var app = angular.module('verbApp');

// General verb related helper data
app.factory('thackstonExercises', function() {

    var data = {};

    data.exercises =   [
        {
            question: 'واتل عليهم نبأ ابني آدم بالحق إذ قرّبا قربانًا فتُقبّل من أحدهما ولم يتقلّل من الآخر. قال لأقتلنَّك. قال إنما يتقبَّل الله من المتّقين. لَئن بسطت يدك إليّ لتقتلني ما أنا بباسط يدي إليك لأقتلك. إني أخاف الله رب العالمين',
            answer: 'واتل عليهم نبأ ابني آدم بالحق إذ قرّبا قربانًا فتُقبّل من أحدهما ولم يتقلّل من الآخر. قال لأقتلنَّك. قال إنما يتقبَّل الله من المتّقين. لَئن بسطت يدك إليّ لتقتلني ما أنا بباسط يدي إليك لأقتلك. إني أخاف الله رب العالمين',
            chapter: 18
        },
        {
            question: 'ما كان لنفس أن تموت إلا بإذن الله',
            answer: 'ما كانَ لِنفسٍ أَنْ تَمُوتَ إِلَّا بِإِذْنِ اللهِ',
            chapter: 18
        },
        {
            question: 'فقال الملك لمريم أنا رسول ربك لأهب لك ولداً',
            answer: 'فَقالَ المَلَكُ لِمَرْيَمَ أَنا رَسُولُ رَبِّكِ لِأَهِبَ لَكِ وَلَداً',
            chapter: 18
        },
        {
            question: 'أيودّ أحدكم أن تكون له جنة من نخيل وأعناب',
            answer: 'أَيَوَدُّ أَحَدُكُمْ أَنْ تَكُونَ لَهُ جَنَّةٌ مِنْ نَخِيلٍ وَأَعْنابٍ',
            chapter: 18
        },
        {
            question: 'أعبد ربي حتى يأتيني اليقين',
            answer: 'أَعْبُدُ رَبِّي حَتَّى يَأْتِيَنِي اليَقِينُ',
            chapter: 18
        },
        {
            question: 'يا ربنا وسعت كل شيء رحمة وعلما',
            answer: 'يا رَبَّنا وَسِعْتَ كَلَّ شَيْءٍ رَحْمَةً وَعِلْماً',
            chapter: 18
        },
        {
            question: 'ما يكون لنا أن نعدكم بذلك',
            answer: 'ما يَكُونُ لَنا أَنْ نَعِدَكُمْ بِذلِكَ',
            chapter: 18
        },
        {
            question: 'فإن الأخوين جاءا ليرثا أباهما',
            answer: 'فَإِنَّ الأَخَوَينِ جاءا لِيَرِثا أَباهُما',
            chapter: 18
        },
        {
            question: 'أمرني الشيطان أن أقرب الكفار',
            answer: 'أَمَرَنِي الشَيطانُ أَنْ أقْرَبَ الكُفّارَ',
            chapter: 18
        },
        {
            question: 'قالت بنو إسرائيل يا موسى لن نصبر على طعام واحد',
            answer: 'قالَتْ بَنُو إِسْرائِيل يا مُوسى لَنْ نَصْبِرَ عَلى طَعامٍ واحِدٍ',
            chapter: 18
        },
        {
            question: 'أمرني أن أكون من المؤمنين',
            answer: 'أَمَرَنِي أَنْ أَكُونَ مِنْ المُؤْمِنِينَ',
            chapter: 18
        },
        {
            question: 'أتنهانا أن نعبد ما يعبد آباؤنا',
            answer: 'أَتَنْهانا أَنْ نَعْبُدَ ما يَعْبُدُ آباؤُنا',
            chapter: 18
        },
        {
            question: 'قال الله لإبليس ما منعك ألا تسجد لما خلقت بيدي',
            answer: 'قالَ اللهُ لِإِبْلِيسَ ما مَنَعَكَ أَلَّا تَسْجُدَ لِما خَلَقْتُ بِيَدِي',
            chapter: 18
        },
        {
            question: 'نهونا أن نأكل من فواكه أشجار حدائقهم فنكون من الظالمين',
            answer: 'نَهَونا أَنْ نَأْكُلَ مِنْ فَواكِهِ أَشْجارِ حَدائِقِهِمْ فَنَكُونَ مِنْ الظالِمِينَ',
            chapter: 18
        },
        {
            question: 'وقلنا لهم اسكنوا هذه القرية وكلوا منها حيث شئتم',
            answer: 'وَقُلْنَا لَهُمْ اُسْكُنُوا هَذِهِ القَرْيَةَ وَكُلُوا مِنْهَا حَيْثُ شِئْتُمْ',
            chapter: 19
        },
        {
            question: 'ففروا إلى الله إني لكم منه نذير مبين',
            answer: 'فَفِرُّوا إِلى اللهِ إِنِّي لَكُمْ مِنْهُ نَذِيرٌ مُبِينٌ',
            chapter: 19
        },
        {
            question: 'ما تسقط من ورق إلا يعلمها',
            answer: 'ما تَسْقُطُ مِنْ وَرَقٍ إِلّا يَعْلَمُها',
            chapter: 19
        },
        {
            question: 'لا تبعث مالك إليهم حتى تعلم أهم أتقياء أم لا',
            answer: 'لا تَبْعَثْ مالَكَ إِلَيهِمْ حَتّى تَعْلَمَ أَهُمْ أَتْقِياءُ أَمْ لا',
            chapter: 19
        },
        {
            question: 'فقالت نساء مصر إنا لنرى زليخا في ضلال مبين فلما سمعت بقولهن دعتهن وقالت ليوسف اخرج عليهن فلما رأينه قلن ليس هذا بشراً إن هذا إلا ملك كريم',
            answer: 'فَقالَتْ نِساءُ مِصْرَ إِنّا لَنَرَى زُلَيخا فِي ضَلالٍ مُبِينٍ فَلَمّا سَمِعَتْ بِقَوْلِهِنَّ دَعَتْهُنَّ وَقالَتْ لِيُوسُفَ اُخْرُجْ عَلَيهِنَّ فَلَمّا رَأَينَهُ قُلْنَ لَيسَ هذا بَشَراً إِنْ هذا إِلّا مَلَكٌ كَرِيمٌ',
            chapter: 19
        },
        {
            question: 'سوف يعلمون, حين يرون العذاب, من أضل',
            answer: 'سَوفَ يَعْلَمُونَ, حِينَ يَرَونَ العَذابَ, مَنْ أَضَلُّ',
            chapter: 19
        },
        {
            question: 'يا ربنا اغفر لنا وارحمنا وأنت أرحم الراحمين',
            answer: 'يا رَبَّنا اِغْفِرْ لَنا وَاِرْحَمْنا وَأَنْتَ أَرْحَمُ الراحِمِينَ',
            chapter: 19
        },
        {
            question: 'يا أيها الناس اذكروا الله ذكرا كثيرا',
            answer: 'يا أَيُّها الناسُ اُذْكُرُوا اللهَ ذِكْرَاً كَثِيراً',
            chapter: 19
        },
        {
            question: 'هو الله أحد لم يلد',
            answer: 'هُوَ اللهُ أحَدٌ لَمْ يَلِدْ',
            chapter: 19
        },
        {
            question: 'فعلمنا منه ما لم نعلم',
            answer: 'فَعَلِمْنا مِنْهُ ما لَمْ نَعْلَمْ',
            chapter: 19
        },
        {
            question: 'فخذها بالقوة وأمر قومك أن يأخذوا أموال الناس',
            answer: 'فَخُذْها بِالقُوَّةِ وَأْمُرْ قَومَكَ أَنْ يَأخُذُوا أَمْوالَ الناسِ',
            chapter: 19
        },
        {
            question: 'أولم تنصحنا ألا نقرب الذين هم أشد منا وهم مارّون على مدينتنا',
            answer: 'أَوَلَمْ تَنْصَحْنا أَلّا نَقْرَبَ الذِينَ هُمْ أَشَدُّ مِنّا وَهُمْ مارُّونَ عَلى مَدِينَتِنا',
            chapter: 19
        }
    ]

    // Will result in [{name: 1}, {name: 2}...]
    data.chapters = getChapters();

    function getChapters() {
        //var nums = _.range(18,41);
        var nums = _.range(18,20);
        return _.map(nums, function(num) {
            return {name: num};
        })
    }

    return data;
})
